# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'oven-sh/bun'
tap 'withgraphite/tap'
tap 'shivammathur/extensions'

# Binaries
brew 'awscli'
brew 'bash'
brew 'coreutils' # Those that come with macOS are outdated
brew 'graphviz'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg' # Dependency for pass etc but slightly conflicts with gpg-suite see https://github.com/Homebrew/homebrew-core/issues/74447
brew 'grep'
brew 'httpie'
brew "openjdk"
brew 'openvpn'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'pass'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'starship' # fancy shell prompt
brew 'asimov' # Exclude node_modules etc from TM backup
brew 'git-absorb' # amazing tool for better git fixup
brew 'git-town' # Simple git stacking tool
brew 'withgraphite/tap/graphite' # Advanced stacking tool with web app
brew 'ansible'
brew 'ansible-lint'
brew 'jq'
brew 'scrcpy'
brew 'poppler' # PDF manipulation
brew 'qpdf'
brew 'rename'
brew 'git-delta'
brew 'imagemagick'
brew 'nginx'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php@8.3'
brew 'shivammathur/extensions/xdebug@8.3'
brew 'shivammathur/extensions/redis@8.3'
brew 'shivammathur/extensions/imagick@8.3'
brew 'shivammathur/extensions/swoole@8.3'
brew 'php@8.2'
brew 'shivammathur/extensions/xdebug@8.2'
brew 'shivammathur/extensions/redis@8.2'
brew 'shivammathur/extensions/imagick@8.2'
brew 'shivammathur/extensions/swoole@8.2'
brew 'php@8.1'
brew 'shivammathur/extensions/xdebug@8.1'
brew 'shivammathur/extensions/redis@8.1'
brew 'shivammathur/extensions/imagick@8.1'
brew 'shivammathur/extensions/swoole@8.1'

brew 'composer'
brew 'node'
brew 'deno'
brew 'bun'
brew 'yarn'
brew 'pnpm'
brew 'go'
brew 'rustup'
brew 'cargo-make'

# Apps
cask '1password'
cask '1password-cli'
cask 'around'
cask 'discord'
cask 'docker'
cask 'caffeine'
cask 'chromium', args: { no_quarantine: true }
cask 'element'
cask 'figma'
cask 'firefox'
cask 'gpg-suite'
cask 'imageoptim'
cask 'iterm2'
cask 'microsoft-office'
cask 'microsoft-teams' # requires rosetta
cask 'notion'
cask 'rectangle'
cask 'ray'
cask 'signal'
cask 'dbeaver-community'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'basecamp'
cask 'setapp'
cask 'spotify'
cask 'mactex'
cask 'android-studio'
cask 'android-platform-tools'
cask 'tunnelblick'
cask 'raycast'
cask 'phpstorm'
cask 'jetbrains-toolbox'
cask 'arq'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-montserrat'
cask 'font-inter'
cask 'font-reenie-beanie'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Strongbox - KeePass & PwSafe', id: 897283731
