# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash'
brew 'coreutils' # Those that come with macOS are outdated
brew 'graphviz'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg' # Dependency for pass etc but slightly conflicts with gpg-suite see https://github.com/Homebrew/homebrew-core/issues/74447
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mailhog'
brew "openjdk"
brew 'openvpn'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'pass'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'pcre2' # Needed to build swoole
brew 'openssl' # Needed to build swoole
brew 'starship' # fancy shell prompt

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'pnpm'
brew 'ansible'
brew 'jq'
brew 'scrcpy'
brew 'go'
brew 'deno'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'around'
cask 'discord'
cask 'docker'
cask 'caffeine'
# cask 'cleanshot'
cask 'chromium', args: { no_quarantine: true }
cask 'element'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'microsoft-office'
cask 'microsoft-teams' # requires rosetta
cask 'notion'
cask 'pastebot'
cask 'phpmon'
cask 'rectangle'
cask 'ray'
cask 'signal'
# cask 'tableplus'
cask 'dbeaver-community'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
cask 'gitkraken'
cask 'basecamp'
cask 'setapp'
cask 'spotify'
cask 'mactex'
cask 'android-studio'
cask 'android-platform-tools'
cask 'tunnelblick'
cask 'raycast'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-montserrat'
cask 'font-inter'
cask 'font-reenie-beanie'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
mas 'harvest', id: 506189836
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Strongbox - KeePass & PwSafe', id: 897283731
